{"format": "layers-model", "generatedBy": "keras v2.1.6", "convertedBy": "TensorFlow.js Converter v1.7.4", "modelTopology": {"keras_version": "2.1.6", "backend": "tensorflow", "model_config": {"config": {"input_layers": [["input_1", 0, 0]], "output_layers": [["conv2d_10", 0, 0], ["conv2d_13", 0, 0]], "name": "model_1", "layers": [{"config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, null, null, 3], "name": "input_1"}, "class_name": "InputLayer", "name": "input_1", "inbound_nodes": []}, {"config": {"padding": "same", "filters": 16, "kernel_constraint": null, "trainable": true, "kernel_regularizer": {"config": {"l2": 0.0005000000237487257, "l1": 0.0}, "class_name": "L1L2"}, "bias_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "activity_regularizer": null, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_1", "bias_constraint": null, "use_bias": false, "activation": "linear", "data_format": "channels_last"}, "class_name": "Conv2D", "name": "conv2d_1", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"config": {"scale": true, "gamma_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "beta_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "momentum": 0.99, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "name": "batch_normalization_1", "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1}, "class_name": "BatchNormalization", "name": "batch_normalization_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "leaky_re_lu_1", "alpha": 0.10000000149011612}, "class_name": "LeakyReLU", "name": "leaky_re_lu_1", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"config": {"padding": "same", "strides": [2, 2], "name": "max_pooling2d_1", "trainable": true, "pool_size": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D", "name": "max_pooling2d_1", "inbound_nodes": [[["leaky_re_lu_1", 0, 0, {}]]]}, {"config": {"padding": "same", "filters": 32, "kernel_constraint": null, "trainable": true, "kernel_regularizer": {"config": {"l2": 0.0005000000237487257, "l1": 0.0}, "class_name": "L1L2"}, "bias_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "activity_regularizer": null, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_2", "bias_constraint": null, "use_bias": false, "activation": "linear", "data_format": "channels_last"}, "class_name": "Conv2D", "name": "conv2d_2", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"config": {"scale": true, "gamma_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "beta_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "momentum": 0.99, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "name": "batch_normalization_2", "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1}, "class_name": "BatchNormalization", "name": "batch_normalization_2", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "leaky_re_lu_2", "alpha": 0.10000000149011612}, "class_name": "LeakyReLU", "name": "leaky_re_lu_2", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"config": {"padding": "same", "strides": [2, 2], "name": "max_pooling2d_2", "trainable": true, "pool_size": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D", "name": "max_pooling2d_2", "inbound_nodes": [[["leaky_re_lu_2", 0, 0, {}]]]}, {"config": {"padding": "same", "filters": 64, "kernel_constraint": null, "trainable": true, "kernel_regularizer": {"config": {"l2": 0.0005000000237487257, "l1": 0.0}, "class_name": "L1L2"}, "bias_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "activity_regularizer": null, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_3", "bias_constraint": null, "use_bias": false, "activation": "linear", "data_format": "channels_last"}, "class_name": "Conv2D", "name": "conv2d_3", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"config": {"scale": true, "gamma_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "beta_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "momentum": 0.99, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "name": "batch_normalization_3", "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1}, "class_name": "BatchNormalization", "name": "batch_normalization_3", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "leaky_re_lu_3", "alpha": 0.10000000149011612}, "class_name": "LeakyReLU", "name": "leaky_re_lu_3", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"config": {"padding": "same", "strides": [2, 2], "name": "max_pooling2d_3", "trainable": true, "pool_size": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D", "name": "max_pooling2d_3", "inbound_nodes": [[["leaky_re_lu_3", 0, 0, {}]]]}, {"config": {"padding": "same", "filters": 128, "kernel_constraint": null, "trainable": true, "kernel_regularizer": {"config": {"l2": 0.0005000000237487257, "l1": 0.0}, "class_name": "L1L2"}, "bias_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "activity_regularizer": null, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_4", "bias_constraint": null, "use_bias": false, "activation": "linear", "data_format": "channels_last"}, "class_name": "Conv2D", "name": "conv2d_4", "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]]}, {"config": {"scale": true, "gamma_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "beta_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "momentum": 0.99, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "name": "batch_normalization_4", "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1}, "class_name": "BatchNormalization", "name": "batch_normalization_4", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "leaky_re_lu_4", "alpha": 0.10000000149011612}, "class_name": "LeakyReLU", "name": "leaky_re_lu_4", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"config": {"padding": "same", "strides": [2, 2], "name": "max_pooling2d_4", "trainable": true, "pool_size": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D", "name": "max_pooling2d_4", "inbound_nodes": [[["leaky_re_lu_4", 0, 0, {}]]]}, {"config": {"padding": "same", "filters": 256, "kernel_constraint": null, "trainable": true, "kernel_regularizer": {"config": {"l2": 0.0005000000237487257, "l1": 0.0}, "class_name": "L1L2"}, "bias_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "activity_regularizer": null, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_5", "bias_constraint": null, "use_bias": false, "activation": "linear", "data_format": "channels_last"}, "class_name": "Conv2D", "name": "conv2d_5", "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]]}, {"config": {"scale": true, "gamma_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "beta_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "momentum": 0.99, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "name": "batch_normalization_5", "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1}, "class_name": "BatchNormalization", "name": "batch_normalization_5", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "leaky_re_lu_5", "alpha": 0.10000000149011612}, "class_name": "LeakyReLU", "name": "leaky_re_lu_5", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]]}, {"config": {"padding": "same", "strides": [2, 2], "name": "max_pooling2d_5", "trainable": true, "pool_size": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D", "name": "max_pooling2d_5", "inbound_nodes": [[["leaky_re_lu_5", 0, 0, {}]]]}, {"config": {"padding": "same", "filters": 512, "kernel_constraint": null, "trainable": true, "kernel_regularizer": {"config": {"l2": 0.0005000000237487257, "l1": 0.0}, "class_name": "L1L2"}, "bias_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "activity_regularizer": null, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_6", "bias_constraint": null, "use_bias": false, "activation": "linear", "data_format": "channels_last"}, "class_name": "Conv2D", "name": "conv2d_6", "inbound_nodes": [[["max_pooling2d_5", 0, 0, {}]]]}, {"config": {"scale": true, "gamma_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "beta_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "momentum": 0.99, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "name": "batch_normalization_6", "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1}, "class_name": "BatchNormalization", "name": "batch_normalization_6", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "leaky_re_lu_6", "alpha": 0.10000000149011612}, "class_name": "LeakyReLU", "name": "leaky_re_lu_6", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]]}, {"config": {"padding": "same", "strides": [1, 1], "name": "max_pooling2d_6", "trainable": true, "pool_size": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D", "name": "max_pooling2d_6", "inbound_nodes": [[["leaky_re_lu_6", 0, 0, {}]]]}, {"config": {"padding": "same", "filters": 1024, "kernel_constraint": null, "trainable": true, "kernel_regularizer": {"config": {"l2": 0.0005000000237487257, "l1": 0.0}, "class_name": "L1L2"}, "bias_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "activity_regularizer": null, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_7", "bias_constraint": null, "use_bias": false, "activation": "linear", "data_format": "channels_last"}, "class_name": "Conv2D", "name": "conv2d_7", "inbound_nodes": [[["max_pooling2d_6", 0, 0, {}]]]}, {"config": {"scale": true, "gamma_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "beta_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "momentum": 0.99, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "name": "batch_normalization_7", "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1}, "class_name": "BatchNormalization", "name": "batch_normalization_7", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "leaky_re_lu_7", "alpha": 0.10000000149011612}, "class_name": "LeakyReLU", "name": "leaky_re_lu_7", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]]}, {"config": {"padding": "same", "filters": 256, "kernel_constraint": null, "trainable": true, "kernel_regularizer": {"config": {"l2": 0.0005000000237487257, "l1": 0.0}, "class_name": "L1L2"}, "bias_regularizer": null, "kernel_size": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "activity_regularizer": null, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_8", "bias_constraint": null, "use_bias": false, "activation": "linear", "data_format": "channels_last"}, "class_name": "Conv2D", "name": "conv2d_8", "inbound_nodes": [[["leaky_re_lu_7", 0, 0, {}]]]}, {"config": {"scale": true, "gamma_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "beta_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "momentum": 0.99, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "name": "batch_normalization_8", "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1}, "class_name": "BatchNormalization", "name": "batch_normalization_8", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "leaky_re_lu_8", "alpha": 0.10000000149011612}, "class_name": "LeakyReLU", "name": "leaky_re_lu_8", "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]]}, {"config": {"padding": "same", "filters": 128, "kernel_constraint": null, "trainable": true, "kernel_regularizer": {"config": {"l2": 0.0005000000237487257, "l1": 0.0}, "class_name": "L1L2"}, "bias_regularizer": null, "kernel_size": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "activity_regularizer": null, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_11", "bias_constraint": null, "use_bias": false, "activation": "linear", "data_format": "channels_last"}, "class_name": "Conv2D", "name": "conv2d_11", "inbound_nodes": [[["leaky_re_lu_8", 0, 0, {}]]]}, {"config": {"scale": true, "gamma_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "beta_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "momentum": 0.99, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "name": "batch_normalization_10", "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1}, "class_name": "BatchNormalization", "name": "batch_normalization_10", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "leaky_re_lu_10", "alpha": 0.10000000149011612}, "class_name": "LeakyReLU", "name": "leaky_re_lu_10", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]]}, {"config": {"size": [2, 2], "name": "up_sampling2d_1", "trainable": true, "data_format": "channels_last"}, "class_name": "UpSampling2D", "name": "up_sampling2d_1", "inbound_nodes": [[["leaky_re_lu_10", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "concatenate_1", "axis": -1}, "class_name": "Concatenate", "name": "concatenate_1", "inbound_nodes": [[["up_sampling2d_1", 0, 0, {}], ["leaky_re_lu_5", 0, 0, {}]]]}, {"config": {"padding": "same", "filters": 512, "kernel_constraint": null, "trainable": true, "kernel_regularizer": {"config": {"l2": 0.0005000000237487257, "l1": 0.0}, "class_name": "L1L2"}, "bias_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "activity_regularizer": null, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_9", "bias_constraint": null, "use_bias": false, "activation": "linear", "data_format": "channels_last"}, "class_name": "Conv2D", "name": "conv2d_9", "inbound_nodes": [[["leaky_re_lu_8", 0, 0, {}]]]}, {"config": {"padding": "same", "filters": 256, "kernel_constraint": null, "trainable": true, "kernel_regularizer": {"config": {"l2": 0.0005000000237487257, "l1": 0.0}, "class_name": "L1L2"}, "bias_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "activity_regularizer": null, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_12", "bias_constraint": null, "use_bias": false, "activation": "linear", "data_format": "channels_last"}, "class_name": "Conv2D", "name": "conv2d_12", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"config": {"scale": true, "gamma_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "beta_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "momentum": 0.99, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "name": "batch_normalization_9", "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1}, "class_name": "BatchNormalization", "name": "batch_normalization_9", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]]}, {"config": {"scale": true, "gamma_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "beta_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "momentum": 0.99, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "name": "batch_normalization_11", "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1}, "class_name": "BatchNormalization", "name": "batch_normalization_11", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "leaky_re_lu_9", "alpha": 0.10000000149011612}, "class_name": "LeakyReLU", "name": "leaky_re_lu_9", "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "leaky_re_lu_11", "alpha": 0.10000000149011612}, "class_name": "LeakyReLU", "name": "leaky_re_lu_11", "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]]}, {"config": {"padding": "same", "filters": 27, "kernel_constraint": null, "trainable": true, "kernel_regularizer": {"config": {"l2": 0.0005000000237487257, "l1": 0.0}, "class_name": "L1L2"}, "bias_regularizer": null, "kernel_size": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "activity_regularizer": null, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_10", "bias_constraint": null, "use_bias": true, "activation": "linear", "data_format": "channels_last"}, "class_name": "Conv2D", "name": "conv2d_10", "inbound_nodes": [[["leaky_re_lu_9", 0, 0, {}]]]}, {"config": {"padding": "same", "filters": 27, "kernel_constraint": null, "trainable": true, "kernel_regularizer": {"config": {"l2": 0.0005000000237487257, "l1": 0.0}, "class_name": "L1L2"}, "bias_regularizer": null, "kernel_size": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "activity_regularizer": null, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_13", "bias_constraint": null, "use_bias": true, "activation": "linear", "data_format": "channels_last"}, "class_name": "Conv2D", "name": "conv2d_13", "inbound_nodes": [[["leaky_re_lu_11", 0, 0, {}]]]}]}, "class_name": "Model"}}, "weightsManifest": [{"paths": ["group1-shard1of9.bin", "group1-shard2of9.bin", "group1-shard3of9.bin", "group1-shard4of9.bin", "group1-shard5of9.bin", "group1-shard6of9.bin", "group1-shard7of9.bin", "group1-shard8of9.bin", "group1-shard9of9.bin"], "weights": [{"name": "batch_normalization_1/gamma", "shape": [16], "dtype": "float32"}, {"name": "batch_normalization_1/beta", "shape": [16], "dtype": "float32"}, {"name": "batch_normalization_1/moving_mean", "shape": [16], "dtype": "float32"}, {"name": "batch_normalization_1/moving_variance", "shape": [16], "dtype": "float32"}, {"name": "batch_normalization_10/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_10/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_10/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_10/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_11/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_11/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_11/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_11/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_2/gamma", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_2/beta", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_2/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_2/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_3/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_3/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_3/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_3/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_4/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_4/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_4/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_4/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_5/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_5/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_5/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_5/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_6/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_6/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_6/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_6/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_7/gamma", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_7/beta", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_7/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_7/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_8/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_8/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_8/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_8/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_9/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_9/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_9/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_9/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv2d_1/kernel", "shape": [3, 3, 3, 16], "dtype": "float32"}, {"name": "conv2d_10/kernel", "shape": [1, 1, 512, 27], "dtype": "float32"}, {"name": "conv2d_10/bias", "shape": [27], "dtype": "float32"}, {"name": "conv2d_11/kernel", "shape": [1, 1, 256, 128], "dtype": "float32"}, {"name": "conv2d_12/kernel", "shape": [3, 3, 384, 256], "dtype": "float32"}, {"name": "conv2d_13/kernel", "shape": [1, 1, 256, 27], "dtype": "float32"}, {"name": "conv2d_13/bias", "shape": [27], "dtype": "float32"}, {"name": "conv2d_2/kernel", "shape": [3, 3, 16, 32], "dtype": "float32"}, {"name": "conv2d_3/kernel", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "conv2d_4/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "conv2d_5/kernel", "shape": [3, 3, 128, 256], "dtype": "float32"}, {"name": "conv2d_6/kernel", "shape": [3, 3, 256, 512], "dtype": "float32"}, {"name": "conv2d_7/kernel", "shape": [3, 3, 512, 1024], "dtype": "float32"}, {"name": "conv2d_8/kernel", "shape": [1, 1, 1024, 256], "dtype": "float32"}, {"name": "conv2d_9/kernel", "shape": [3, 3, 256, 512], "dtype": "float32"}]}]}